2018/python-trivial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-01 周三 12:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python 琐碎</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rgb_24bit24bit" />


</head>
<body>
<div id="content">
<h1 class="title">Python 琐碎</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdce8613">1. 前言</a></li>
<li><a href="#org5c09140">2. 成员相关</a>
<ul>
<li><a href="#org58f27cc">2.1. 保护成员和私有成员</a></li>
<li><a href="#orgd9630b5">2.2. 内置成员</a></li>
</ul>
</li>
<li><a href="#orgd55807a">3. 类属性和实例属性的理解</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdce8613" class="outline-2">
<h2 id="orgdce8613"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
这篇博客用于总结 <code>Python</code> 中较为零散的概念的理解。
</p>
</div>
</div>

<div id="outline-container-org5c09140" class="outline-2">
<h2 id="org5c09140"><span class="section-number-2">2</span> 成员相关</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org58f27cc" class="outline-3">
<h3 id="org58f27cc"><span class="section-number-3">2.1</span> 保护成员和私有成员</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><p>
<b>单下划线</b> 开头的对象为 <b>保护成员</b>, 如 <code>_obj</code>.
</p>

<p>
<b>保护成员</b> 不能通过 <code>from module impport *</code> 的方式导入， 但可以在使用
<code>import module</code> 导入模块后， 通过 <code>module._obj</code> 的形式访问。
</p>

<p>
除此之外， <b>保护成员</b> 的行为与一般成员的行为 <b>无区别</b>.
</p></li>

<li><b>双下划线</b> 开头的对象为 <b>私有成员</b>, 只能由 <b>类对象</b> 自身进行访问。 但可以通过 <code>_class__obj</code> 的
形式强行访问。</li>
</ul>

<div class="org-src-container">
<pre class="src src-python">In [1]: <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Test</span>(<span style="font-weight: bold;">object</span>):
   ...:     <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
   ...:         <span style="font-weight: bold;">self</span>._protect = 10
   ...:         <span style="font-weight: bold;">self</span>.__private = 10
   ...:

In [2]: <span style="font-weight: bold; font-style: italic;">t</span> = Test()

In [3]: t._protect
Out[3]: 10

In [4]: t.__private
---------------------------------------------------------------------------
<span style="font-weight: bold; text-decoration: underline;">AttributeError</span>                            Traceback (most recent call last)
&lt;ipython-<span style="font-weight: bold;">input</span>-4-948bf5e358da&gt; <span style="font-weight: bold;">in</span> &lt;module&gt;()
----&gt; 1 t.__private

<span style="font-weight: bold; text-decoration: underline;">AttributeError</span>: <span style="font-style: italic;">'Test'</span> <span style="font-weight: bold;">object</span> has no attribute <span style="font-style: italic;">'__private'</span>

In [5]: t._Test__private
Out[5]: 10
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9630b5" class="outline-3">
<h3 id="orgd9630b5"><span class="section-number-3">2.2</span> 内置成员</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><p>
<code>__name__</code> <b>模块</b> 或 <b>类</b> 的名称， 如果 <b>模块</b> 是被直接执行的模块， <code>__name__</code> 的值为 <code>__main__</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">In [7]: <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Test</span>(<span style="font-weight: bold;">object</span>):
   ...:     <span style="font-weight: bold;">pass</span>
   ...:

In [8]: Test.<span style="font-weight: bold;">__name__</span>
Out[8]: <span style="font-style: italic;">'Test'</span>
</pre>
</div>

<p>
<b>注：</b> <b>类实例</b> 没有 <code>__name__</code> 属性。
</p></li>

<li><p>
<code>__dict__</code> 用来存储 <b>对象属性</b> 的一个字典， 其 <b>键</b> 为 <b>属性名</b>, <b>值</b> 为 <b>属性</b> 的值.
</p>

<p>
需要注意的是：
</p>
<ol class="org-ol">
<li>并不是所有对象都拥有 <code>__dict__</code> 属性， 许多内建类型就没有 <code>__dict__</code> 属性</li>

<li>实例的 <code>__dict__</code> 仅存储与该实例相关的实例属性</li>

<li>类的 <code>__dict__</code> 存储所有实例共享的变量和函数, 类的 <code>__dict__</code> 并不包含其父类的属性</li>
</ol></li>

<li><code>__doc__</code> 定义一个 <b>对象</b> 的 <b>文档字符串</b>.</li>

<li><code>__path__</code> 包含这个属性的 <b>模块</b> 会被当做一个 <b>包</b>.</li>

<li><code>__class__</code> 当前对象的类</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd55807a" class="outline-2">
<h2 id="orgd55807a"><span class="section-number-2">3</span> 类属性和实例属性的理解</h2>
<div class="outline-text-2" id="text-3">
<p>
搞清楚 <b>类属性</b> 和 <b>实例属性</b> 的关系之前， 需要明确的几点是：
</p>
<ol class="org-ol">
<li><code>Python</code> 之中， 一切皆是对象</li>
<li><code>class</code> 是 <code>type</code> 的实例</li>
<li><code>instance</code> 是 <code>class</code> 的实例</li>
<li><b>获取属性</b> 和 <b>设置属性</b> 的行为不同</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">OneClass</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold; font-style: italic;">num</span> = 10


<span style="font-weight: bold; font-style: italic;">A</span> = OneClass()
<span style="font-weight: bold; font-style: italic;">B</span> = OneClass()
<span style="font-weight: bold;">print</span>(A.num, B.num, OneClass.num)

<span style="font-weight: bold; font-style: italic;">A.num</span> += 2
<span style="font-weight: bold;">print</span>(A.num, B.num, OneClass.num)

<span style="font-weight: bold; font-style: italic;">OneClass.num</span> += 2
<span style="font-weight: bold;">print</span>(A.num, B.num, OneClass.num)
</pre>
</div>

<p>
以上代码的执行结果为：
</p>
<pre class="example">
10 10 10
12 10 10
12 12 12
</pre>

<p>
<b>理解</b>:
</p>
<ol class="org-ol">
<li><b>类</b> 是一个对象， <b>实例</b> 也是一个对象</li>
<li>通过 <code>self.xxx = xxx</code> 的方式设置的属性直接 <b>绑定</b> 到 <b>实例对象</b></li>
<li>直接在 <b>类</b> 内部定义的属性 <b>没有绑定</b> 到 <b>实例</b>, 而是 <b>绑定</b> 到 <b>类</b> 对象</li>
<li>访问一个 <b>实例对象</b> 不存在的 <b>属性</b> 的时候会尝试从 <b>类对象</b> 获去那个属性</li>
<li>设置 一个 <b>实例对象</b> 不存在的 <b>属性</b> 的值的时候， 会尝试从 <b>类对象</b> 获取属性的值，
然后将运算后的结果 <b>绑定</b> 到 <b>实例</b> 上， 使之成为 <b>实例属性</b></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-05-02 周三 00:00</p>
<p class="author">Author: rgb<sub>24bit</sub></p>
<p class="date">Created: 2018-08-01 周三 12:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
